Courses/7140/Lectures/Projects/PDF/pdf-annote.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Adv Software Engineering Project: PDF Library iText</title>
<!-- 2016-05-28 Sat 22:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CEG7380 Cloud Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Adv Software Engineering Project: PDF Library iText</h1>
<p>
<code>pdftk</code>
</p>

<ol class="org-ol">
<li><a href="https://github.com/itext/itext7">https://github.com/itext/itext7</a> iText 7 Community; src code repository
</li>
<li><a href="http://developers.itextpdf.com/content/itext-7-jump-start-tutorial">http://developers.itextpdf.com/content/itext-7-jump-start-tutorial</a>
</li>

<li><a href="http://resources.infosecinstitute.com/pdf-file-format-basic-structure/">http://resources.infosecinstitute.com/pdf-file-format-basic-structure/</a>
</li>
<li><a href="http://what-when-how.com/itext-5/creating-a-pdf-document-in-five-steps-with-itext/">http://what-when-how.com/itext-5/creating-a-pdf-document-in-five-steps-with-itext/</a>
</li>

<li><a href="https://jaxenter.com/bruno-lowagie-interview-125730.html">https://jaxenter.com/bruno-lowagie-interview-125730.html</a>
</li>
</ol>

<p>
The iText 5 architecture was based on a design from the year 2000,
which has worked for us very well for all those years, though we were
reaching the limits of that architecture. One major problem that we
had, the number 1 request from users, was support for Indic languages,
such as Hindi. This required a complete rewrite of our font support,
which was impossible to do in iText 5, we couldn’t bolt that language
support onto the existing library without breaking a lot of the
functionality. We saw this as an opportunity to come up with a new
architecture that allows us to meet a lot of our other customer
requests at the same time. For instance, EverNote is a customer that
uses iText on Android, that reached the implementation limits of iText
and so they’ll also benefit from the new architecture, which is more
modular, enabling the user to select which parts they want to use. We
cleaned up the API, in the past it wasn’t possible to see the
difference between a class and an interface, and we have refactored
things to make it more intuitive and consistent from a programming
point of view.
</p>

<p>
Because of the modular approach, iText will be easier to extend. In
iText 7 we support Hindi and Tamil, though we know customers also
want Telugu and other eastern languages. Thanks to the new
architecture, these kinds of needs will be easier to meet
</p>

<p>
Although we developed iText 7 from scratch, and we could have made it
closed source, we decided to keep it open source. Nevertheless, we
will have some modules that will be closed source, because they will
be value add-ons.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> itext-7-7.0.0</h2>
<div class="outline-text-2" id="text-1">
<p>
 4096 barcodes
  896 BUILDING.md
  641 CodeConventions.md
 3235 CODE<sub>OF</sub><sub>CONDUCT</sub>.md
 8985 CONTRIBUTING.md
 4096 font-asian
 4096 forms
34354 gnu-agpl-v3.0.md
 4096 hyph  hyphenation
 4096 io
 4096 kernel
 4096 layout
 2035 LICENSE.md
 4096 pdfa
 4096 pdftest
20317 pom.xml
 4096 sign
 2607 sloccount.txt
  995 Vagrantfile
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-05-25
</div>
</body>
</html>
